# Ultralytics YOLO 🚀, AGPL-3.0 license
# Combined Model: RT-DETR-CDC (Central Difference) + CE Module
# Aim: Infrared Small Target Detection (ISTD) with Enhanced Feature Extraction

# Parameters
nc: 1  # number of classes 
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]

  - [-1, 1, SPCE, [32, 3, 2, None, False]]  # 0 -  (P1/2)
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 1-P2/4
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 3
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 4-P3/8 


  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 5
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 6-P3/8
  - [-1, 1, Blocks, [256, SG_SCConv, 2, 4, 'relu']] # 7-P4/16
  - [-1, 1, Blocks, [512, SG_SCConv, 2, 5, 'relu']] # 8-P5/32
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 13
  - [[-2, -1], 1, Concat, [1]] # 14

  - [-1, 3, GA_RepCDC, [256, 0.5, 0.1]]  # 15, fpn_blocks.0

  - [-1, 1, Conv, [256, 1, 1]]   # 16
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 18
  - [[-2, -1], 1, Concat, [1]]  # 19


  - [-1, 3, GA_RepCDC, [256, 0.5, 0.1]]    # 20,


  - [-1, 1, Conv, [256, 3, 2]]   # 21
  - [[-1, 16], 1, Concat, [1]]  # 22
  - [-1, 3, RepC3, [256, 0.5]]    # 23

  - [-1, 1, Conv, [256, 3, 2]]   # 24
  - [[-1, 11], 1, Concat, [1]]  # 25
  - [-1, 3, RepC3, [256, 0.5]]    # 26

  - [[20, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
